lvx/base/DataProcessors/бит_му_ПодборВНА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_му_ПодборВНА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Построитель отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Режим</Name>
					<Comment>Режим</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_РежимыПодбораВНА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местонахождение</Name>
					<Comment>Местонахождение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКласса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыКлассовОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодНачисленияАмортизации</Name>
					<Comment>Метод начисления амортизации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизацииНМА</v8:Type>
						<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_МоделиУчетаВНА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Comment>Вид движения документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыДвиженияВыбытия</v8:Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийВыбытиеНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьОбъектов</Name>
					<Comment>Перечень объектов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Comment>Выполнять</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНА</Name>
							<Comment>ВНА</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКласса</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_ВидыКлассовОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МодельУчета</Name>
							<Comment>Модель учета</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МоделиУчетаВНА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Comment>Первоначальная стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчету</Name>
							<Comment>Дата принятия к учету</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местонахождение</Name>
							<Comment>Местонахождение</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МОЛ</Name>
							<Comment>МОЛ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументБУ</Name>
							<Comment>Документ БУ</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
								<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковВнеоборотныхАктивов</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
								<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислятьАмортизацию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Comment>Метод начисления амортизации</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизацииНМА</v8:Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_ДоговорыКонтрагентов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоСчету</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоГрафику</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаДолгосрочный</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаКраткосрочный</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисленнойАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаМодернизации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМодернизации</Name>
							<Comment>Сумма модернизации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоРаспределениеНДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/DataProcessors/бит_му_ПодборВНА/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция формирует структуру данных для добавления их в таб.часть документа владельца.
// 
Функция ДанныеДляЗагрузкиВДокументВНА(ДействиеВыбора = "Добавить", ИДСтроки = Неопределено) Экспорт
	
	Если ИДСтроки = Неопределено Тогда
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Выполнять", Истина);
		
		РезТаблица = ПереченьОбъектов.Выгрузить(СтруктураОтбора);
		
	Иначе
		
		ТекущаяСтрока = ПереченьОбъектов[ИДСтроки];
		
		РезТаблица = ПереченьОбъектов.Выгрузить();
		РезТаблица.Очистить(); 		
		
		НоваяСтрока = РезТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрока);
		
	КонецЕсли;
	
	СтруктураТаблиц = Новый Структура;
	
	Если ЗначениеЗаполнено(КорСчет) Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(КорСчет));
		РезТаблица.Колонки.Добавить("КорСчет", Новый ОписаниеТипов(МассивТипов));
		РезТаблица.ЗаполнитьЗначения(КорСчет, "КорСчет")
	КонецЕсли;
	
	
	УпаковатьТаблицу(РезТаблица, СтруктураТаблиц);
	
	РезСтруктура = НовыйРезСтруктура();
	РезСтруктура.Вставить("Действие", ДействиеВыбора);
	РезСтруктура.Вставить("Данные"  , СтруктураТаблиц);
	РезСтруктура.Вставить("Режим"   , Режим);
		
	Возврат РезСтруктура;
	
КонецФункции // ДанныеДляЗагрузкиВДокументВНА()

// Процедура добавляет быстрые отборы для пользователя.
// 
Процедура ДобавитьПользовательскиеОтборы() Экспорт
	
	СтруктураОтбора = Новый Структура;
	
	СтруктураОтбора.Вставить("Организация"		, Новый Структура("Использование, Значение", Истина, Организация));
	СтруктураОтбора.Вставить("Проведен"			, Новый Структура("Использование, Значение", Истина, Истина));
	СтруктураОтбора.Вставить("МОЛ"				, Новый Структура("Использование, Значение", ЗначениеЗаполнено(МОЛ), МОЛ));
	СтруктураОтбора.Вставить("Местонахождение"	, Новый Структура("Использование, Значение", ЗначениеЗаполнено(Местонахождение), Местонахождение));
	
	Если Режим = Перечисления.бит_му_РежимыПодбораВНА.МодернизацияОС 
		ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.НачислениеАмортизацииОС
		ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.ОбесценениеОС
		ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.ПереоценкаОС
		ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.ВыбытиеОС Тогда
		
		СтруктураОтбора.Вставить("ВидКласса", Новый Структура("Использование, Значение", ЗначениеЗаполнено(ВидКласса), ВидКласса));
	КонецЕсли;
	
	Если Режим = Перечисления.бит_му_РежимыПодбораВНА.ВыработкаОС
		ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.ВыработкаНМА Тогда
		
		СтруктураОтбора.Вставить("МетодНачисленияАмортизации", Новый Структура("Использование, Значение", ЗначениеЗаполнено(МетодНачисленияАмортизации), МетодНачисленияАмортизации));
	КонецЕсли;
	
	Если Режим = Перечисления.бит_му_РежимыПодбораВНА.НачислениеАмортизацииОС 
		 ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.НачислениеАмортизацииНМА  Тогда
		
		СтруктураОтбора.Вставить("НачислятьАмортизацию", Новый Структура("Использование, Значение", Истина, Истина));
	КонецЕсли; 
	
	Если Режим = Перечисления.бит_му_РежимыПодбораВНА.ОбесценениеОС
		ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.ПереоценкаОС
		ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.ПереоценкаНМА
		ИЛИ Режим = Перечисления.бит_му_РежимыПодбораВНА.ОбесценениеНМА Тогда
		
		СтруктураОтбора.Вставить("МодельУчета", Новый Структура("Использование, Значение", ЗначениеЗаполнено(МодельУчета), МодельУчета));
	КонецЕсли;
	
	Отбор = Компоновщик.Настройки.Отбор;
	
	Для Каждого ЭлементОтбора Из СтруктураОтбора Цикл
		
		НастройкаЭлемента = ЭлементОтбора.Значение;
		
		ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Ключ);
		ДоступноеПоле = Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора);
		
		Если НЕ НастройкаЭлемента.Использование
			ИЛИ ДоступноеПоле = Неопределено Тогда
			
			Продолжить;
		КонецЕсли;
		
		бит_ОбщегоНазначенияКлиентСервер.УстановитьОтборУСписка(Отбор, ПолеОтбора, НастройкаЭлемента.Значение);
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьПользовательскиеОтборы()

// Процедура заполняет табличную часть ПереченьОбъектов.
// 
Функция ПереченьОбъектовВНА(АдресСКД) Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация"	  , Организация);
	СтруктураПараметров.Вставить("ДатаНачала"	  , ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания"  , ДатаОкончания);
	СтруктураПараметров.Вставить("Режим"		  , Режим);
	СтруктураПараметров.Вставить("ВалютаДокумента", ВалютаДокумента);
	
	ТаблицаОбъектов = Обработки.бит_му_ПодборВНА.ПолучитьПереченьОбъектов(АдресСКД, Компоновщик, СтруктураПараметров);
	
	Возврат ТаблицаОбъектов;
	
КонецФункции // ПереченьОбъектовВНА()

// Функция выполняет подбор ВНА через обработку подбора минуя форму
// 
// Параметры:
//  ПараметрыПодбора - Структура.
//
Функция ВыполнитьПодборДляЗакрытия(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Свойство("Организация"			      , Организация);
	ПараметрыПодбора.Свойство("ДатаНачала"				  , ДатаНачала);
	ПараметрыПодбора.Свойство("ДатаОкончания"			  , ДатаОкончания);
	ПараметрыПодбора.Свойство("Режим"					  , Режим);
	ПараметрыПодбора.Свойство("МОЛ"					      , МОЛ);
	ПараметрыПодбора.Свойство("Местонахождение"		      , Местонахождение);
	ПараметрыПодбора.Свойство("ВидКласса"				  , ВидКласса);
	ПараметрыПодбора.Свойство("МодельУчета"			      , МодельУчета);
	ПараметрыПодбора.Свойство("ВидДвижения"			      , ВидДвижения);
	ПараметрыПодбора.Свойство("МетодНачисленияАмортизации", МетодНачисленияАмортизации);
	ПараметрыПодбора.Свойство("ВалютаДокумента"		      , ВалютаДокумента);
	
	ТекстЗапроса = Обработки.бит_му_ПодборВНА.ПолучитьТекстЗапроса(Режим, ПараметрыПодбора);
	
	АдресСКД = Обработки.бит_му_ПодборВНА.ИнициализироватьСКД(ТекстЗапроса, Новый УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКД);
	
	Компоновщик.Инициализировать(ИсточникНастроек);
	
	СКД = ПолучитьИзВременногоХранилища(АдресСКД);
	Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	ДобавитьПользовательскиеОтборы();
	
	// Обновить перечень объектов
	ТаблицаОбъектов = ПереченьОбъектовВНА(АдресСКД);
	
	СтруктураТаблиц = Новый Структура;	
	УпаковатьТаблицу(ТаблицаОбъектов, СтруктураТаблиц);
	
	РезСтруктура = НовыйРезСтруктура();
	РезСтруктура.Вставить("Действие", "Загрузить");
	РезСтруктура.Вставить("Данные"  , СтруктураТаблиц);
	РезСтруктура.Вставить("Режим", Режим);
	
	Возврат РезСтруктура;
	
КонецФункции // ВыполнитьПодборДляЗакрытия()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйРезСтруктура()

	Возврат Новый Структура("Действие, Данные, Режим");

КонецФункции // НовыйРезСтруктура()

// Процедура преобразует реквизит таблицу значений в массив структур.
// 
// Параметры:
//  СтрТаблиц  - Структура.
//  ИмяТаблицы - Строка.
// 
Процедура УпаковатьТаблицу(Таблица, СтрТаблиц)
	
	МассивРеквизитов = Таблица.Колонки;
	ИменаРеквизитов  = Новый Структура;
	Для каждого Реквизит Из МассивРеквизитов Цикл 		
		ИменаРеквизитов.Вставить(Реквизит.Имя, Реквизит.ТипЗначения);		
	КонецЦикла;
	
	СтрТаблиц.Вставить("ПереченьОбъектов", бит_ОбщегоНазначения.УпаковатьДанныеФормыКоллекция(Таблица, ИменаРеквизитов));
	СтрТаблиц.Вставить("ПереченьОбъектов_Колонки", ИменаРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
